app/views/posts/show.html.erb

<h2>Commenti</h2>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2