app/controllers/posts_controller.rb

  def index
    @posts = Post.order("created_at DESC").all
---
SELECT "posts".* FROM "posts" ORDER BY created_at DsESC

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'ciao sono il primo post saddadsa', "updated_at" = '2013-03-23 15:10:14.435475' WHERE "posts"."id" = 1